#include "game.h"
#include <stdio.h>

void showGameDescription() {
    printf("===============================================================================================\n");
    printf("|                                                                                              |\n");
    printf("|                                          How To Play?                                        |\n");
    printf("|                                                                                              |\n");
    printf("|                                                                                              |\n");
    printf("|                                  이 게임은 주인공 '민서'의                                   |\n");
    printf("|                                   짝사랑남과 잘 될 수 있게                                   |\n");
    printf("|                                    돕는 미연시게임입니다.                                    |\n");
    printf("|                            두가지 선택지 중 올바른 것을 골라서                               |\n");
    printf("|                            민서가 연애할 수 있도록 도와주세요!                               |\n");
    printf("|                                        1. 게임 시작!                                         |\n");
    printf("|                                        2. 메인 화면                                          |\n");
    printf("|                                        3. 게임 종료                                          |\n");
    printf("|                                                                                              |\n");
    printf("===============================================================================================\n");
}
void showGameEndScreen() {
    printf("===============================================================================================\n");
    printf("|                                                                                              |\n");
    printf("|                                                                                              |\n");
    printf("|                                      게임을 종료할까요?                                      |\n");
    printf("|                      (설마 종료하겠어? 내가 얼마나 힘들게 만들었는데...                      |\n");
    printf("|                               내 연애를 도울 마음이 없구나...)                               |\n");
    printf("|                                   평 생 저 주 한 다 . . . .                                  |\n");
    printf("|                                                                                              |\n");
    printf("|                                                                                              |\n");
    printf("|                                                                                              |\n");
    printf("|                                   1. 평생 저주 받는다 우우                                   |\n");
    printf("|                                                                                              |\n");
    printf("|                                   2. 아뇨 제발 종료하지마여ㅜ                                |\n");
    printf("|                                                                                              |\n");
    printf("===============================================================================================\n");
}

void showGameTitleScreen() {
    printf("===============================================================================================\n");
    printf("|    _     _                             _   _                _____                          / |\n");
    printf("|    /    /            /                 /  /|                /    )                        /  |\n");
    printf("|---/___ /------__----/-------__--------/| /-|---------------/----/-----__---_/_-----__----/---|\n");
    printf("|  /    /     /___)  /      /   )      / |/  |   /   /      /    /    /   )  /     /___)  /    |\n");
    printf("|_/____/_____(___ __/______/___/______/__/___|__(___/______/____/____(___(__(_ ___(___ __o_____|\n");
    printf("|                         /                        /                                           |\n");
    printf("|                        /                     (_ /                                            |\n");
    printf("|                                                                                              |\n");
    printf("|                                      1 게임 시작                                             |\n");
    printf("|                                      2 게임 방법                                             |\n");
    printf("|                                      3 게임 종료                                             |\n");
    printf("|                                                                                              |\n");
    printf("===============================================================================================\n");

    printf("선택하세요: ");
}

